{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Banking",
    "1": "Informational",
    "2": "Marketing",
    "3": "Real Estate",
    "4": "Shopping",
    "5": "Spam",
    "6": "Telecom"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Banking": 0,
    "Informational": 1,
    "Marketing": 2,
    "Real Estate": 3,
    "Shopping": 4,
    "Spam": 5,
    "Telecom": 6
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.40.2",
  "vocab_size": 30522
}
